In [29]:
import pandas as pd

people = {
    "first" : ['Kas', 'Tas', 'Bas','Nik'],
    "last" : ['Sar', 'Kar', 'Sar','kus'],
    "email" : ['kar@sar.com', 'tas@kar.com', 'bas@sar.com', 'nik@kus.com']
}

df = pd.DataFrame(people)
df

  first last        email
0   Kas  Sar  kar@sar.com
1   Tas  Kar  tas@kar.com
2   Bas  Sar  bas@sar.com
3   Nik  kus  nik@kus.com

In [30]:
df['last']

0    Sar
1    Kar
2    Sar
3    kus
Name: last, dtype: object

In [31]:
# filter by surname
df['last']=="Sar"

0     True
1    False
2     True
3    False
Name: last, dtype: bool

In [32]:
# now assign the above filter to a data frame. So that it display all rows which match the filter
filt = (df['last'] == 'Sar')
df[filt]

  first last        email
0   Kas  Sar  kar@sar.com
2   Bas  Sar  bas@sar.com

In [33]:
# same we can achieve using loc
df.loc[filt]

  first last        email
0   Kas  Sar  kar@sar.com
2   Bas  Sar  bas@sar.com

In [34]:
df.loc[filt,['email']]

         email
0  kar@sar.com
2  bas@sar.com

In [35]:
# And and or operation
filt = (df['last'] == 'Sar') & (df['first'] == 'Kas')
df.loc[filt,['email']]

         email
0  kar@sar.com

In [36]:
# show everything that does not match the filter
df.loc[~filt, ['email']]

         email
1  tas@kar.com
2  bas@sar.com
3  nik@kus.com

In [37]:
df = pd.read_csv("data/survey_results_public.csv")
schema_df = pd.read_csv('data/survey_results_schema.csv')

pd.set_option('display.max_column',85)
pd.set_option('display.max_rows',85)

high_salary = (df['ConvertedComp'] > 70000)
df.loc[high_salary,['Country', 'LanguageWorkedWith', 'ConvertedComp']]

,Country,LanguageWorkedWith,ConvertedComp
5,Canada,Java;R;SQL,366420.0
8,New Zealand,Bash/Shell/PowerShell;C#;HTML/CSS;JavaScript;P...,95179.0
12,United States,Bash/Shell/PowerShell;HTML/CSS;JavaScript;PHP;...,90000.0
15,United Kingdom,Bash/Shell/PowerShell;C#;HTML/CSS;JavaScript;T...,455352.0
21,United States,Bash/Shell/PowerShell;C++;HTML/CSS;JavaScript;...,103000.0
...,...,...,...
88323,United States,Bash/Shell/PowerShell;C#;HTML/CSS;Java;Python;...,180000.0
88324,United States,Bash/Shell/PowerShell;C;Clojure;HTML/CSS;Java;...,2000000.0
88325,United States,HTML/CSS;JavaScript;Scala;TypeScript,130000.0
88326,Finland,Bash/Shell/PowerShell;C++;Python,82488.0
88329,Netherlands,C#;HTML/CSS;Java;JavaScript;PHP;Python,588012.0

In [38]:
# Filter by countries
countries = ['United States', 'India', 'United Kingdom']
filt = df['Country'].isin(countries)
df.loc[filt,['Country']]

              Country
0      United Kingdom
3       United States
7               India
9               India
12      United States
...               ...
88854  United Kingdom
88859   United States
88863  United Kingdom
88864           India
88877   United States

[35747 rows x 1 columns]

In [39]:
df['LanguageWorkedWith']

0                          HTML/CSS;Java;JavaScript;Python
1                                      C++;HTML/CSS;Python
2                                                 HTML/CSS
3                                      C;C++;C#;Python;SQL
4              C++;HTML/CSS;Java;JavaScript;Python;SQL;VBA
                               ...
88878                        HTML/CSS;JavaScript;Other(s):
88879                                                  NaN
88880                                                  NaN
88881                                                  NaN
88882    Bash/Shell/PowerShell;HTML/CSS;Java;JavaScript...
Name: LanguageWorkedWith, Length: 88883, dtype: object

In [40]:
# str method is very useful method in such filtering
filt = df['LanguageWorkedWith'].str.contains('Python', na=False)
df.loc[filt,['LanguageWorkedWith']]

                                      LanguageWorkedWith
0                        HTML/CSS;Java;JavaScript;Python
1                                    C++;HTML/CSS;Python
3                                    C;C++;C#;Python;SQL
4            C++;HTML/CSS;Java;JavaScript;Python;SQL;VBA
7      Bash/Shell/PowerShell;C;C++;HTML/CSS;Java;Java...
...                                                  ...
88854  Bash/Shell/PowerShell;C;C++;HTML/CSS;Java;Java...
88860    Bash/Shell/PowerShell;C++;Python;Ruby;Other(s):
88865    Bash/Shell/PowerShell;HTML/CSS;Python;Other(s):
88872           C;C++;HTML/CSS;JavaScript;PHP;Python;SQL
88876                         HTML/CSS;JavaScript;Python

[36443 rows x 1 columns]

### Conditional Selection

In [41]:
import numpy as np
import string

new_index = list(string.ascii_uppercase)[0:5]
new_column = list(string.ascii_uppercase)[-4:]

df2 = pd.DataFrame(np.random.randn(5,4),new_index,new_column)
df2

          W         X         Y         Z
A -1.774382 -0.073591  0.518919  0.511203
B  0.310466 -1.018893  0.809089 -0.846339
C  0.385816  1.435335 -0.008225 -0.474107
D  0.507446  1.185314 -0.037311 -1.459043
E  1.448401  1.856371  0.345891  0.179669

In [42]:
df2[df2>0]

          W         X         Y         Z
A       NaN       NaN  0.518919  0.511203
B  0.310466       NaN  0.809089       NaN
C  0.385816  1.435335       NaN       NaN
D  0.507446  1.185314       NaN       NaN
E  1.448401  1.856371  0.345891  0.179669

In [43]:
# In the above approach we will get columns with NaN. If we want table without NaN
df2[(df2['W']>0) & (df2['Y']>0)]

          W         X         Y         Z
B  0.310466 -1.018893  0.809089 -0.846339
E  1.448401  1.856371  0.345891  0.179669

In [46]:
# After segregating where the columns 'W' and 'Y' more than 0. Get the series in X & Z
df2[(df2['W']>0) & (df2['Y']>0)][['X','Z']]

          X         Z
B -1.018893 -0.846339
E  1.856371  0.179669